#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
  
```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`
<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.fiap_x_eks: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_apigatewayv2_api.fiap_x will be created
  + resource "aws_apigatewayv2_api" "fiap_x" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "fiap_x"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # aws_apigatewayv2_stage.dev will be created
  + resource "aws_apigatewayv2_stage" "dev" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "dev"
      + tags_all      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + apigateway_execution_arn = (sensitive value)
  + apigateway_id            = (sensitive value)
  + apigateway_url           = (sensitive value)

```
  
</details>

*Pusher: @gm50x*
*Action: `pull_request`*
*Workflow: `Terraform IAC - API Gateway`*